In [4]:
#importing modules
import pandas as pd
import numpy as np
import seaborn as sns
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [28]:
#leading the data
titanic = sns.load_dataset("titanic")

In [29]:
#selecting the features
titanic_data = titanic[['class','age','who','survived']]
#cleaning the NaN values
titanic_data = titanic_data.dropna()
titanic_data

      class   age    who  survived
0     Third  22.0    man         0
1     First  38.0  woman         1
2     Third  26.0  woman         1
3     First  35.0  woman         1
4     Third  35.0    man         0
..      ...   ...    ...       ...
885   Third  39.0  woman         0
886  Second  27.0    man         0
887   First  19.0  woman         1
889   First  26.0    man         1
890   Third  32.0    man         0

[714 rows x 4 columns]

In [30]:
titanic_data.who.unique()

array(['man', 'woman', 'child'], dtype=object)

In [31]:
#feature engineering
titanic_data = pd.get_dummies(titanic_data,drop_first=True)
titanic_data

      age  survived  class_Second  class_Third  who_man  who_woman
0    22.0         0             0            1        1          0
1    38.0         1             0            0        0          1
2    26.0         1             0            1        0          1
3    35.0         1             0            0        0          1
4    35.0         0             0            1        1          0
..    ...       ...           ...          ...      ...        ...
885  39.0         0             0            1        0          1
886  27.0         0             1            0        1          0
887  19.0         1             0            0        0          1
889  26.0         1             0            0        1          0
890  32.0         0             0            1        1          0

[714 rows x 6 columns]

In [42]:
#spliting into train and test data
x_train, x_test, y_train, y_test = train_test_split(titanic_data.drop(columns={"survived"}),
                                                    titanic_data.survived,train_size=0.8)

In [43]:
#setting the model
logReg = LogisticRegression(solver="lbfgs", penalty="l2")

In [45]:
#model training
logReg.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [46]:
logReg.score(x_test,y_test)

0.7692307692307693